import { Injectable } from '@angular/core';
import { Data_direction } from '../Data_direction';

@Injectable({
  providedIn: 'root'
})
export class DirectionPageServiceService {

  constructor() { }
  public data:Data_direction[] =[];

  GetData(){
    this.data=[];
    this.data.push(new Data_direction("./assets/images/curators/Enshteyn.jpg",
      "професор Енштейн А.А.",
      "Секція \"Інформаційні технології\"",
      "Інформаційні технології - це комплекс взаємозалежних, наукових, технологічних, інженерних дисциплін, що вивчають методи ефективної організації праці людей, зайнятих обробкою і зберіганням інформації; обчислювальну техніку і методи організації і взаємодії з людьми і виробничим устаткуванням, їх практичні додатки, а також зв'язані з усім цим соціальні, економічні та культурні проблеми.Інформаційні технології дали нові можливості для роботи і відпочинку,багато в чому полегшили працю і просто життя кожної сучасної людини.",
      "Enshteyn",
      "сучасні тенденції розвитку інформаційних технологій"
    ));
    this.data.push(new Data_direction("./assets/images/curators/dekart.jpg",
      "професор Декарт Д.Д.",
      "Секція \"Інформаційні системи\"",
      "Інформаційна система, як система управління, тісно пов’язується, як з системами збереження та видачі інформації, так і з іншої - з системами, що забезпечують обмін інформацією в процесі управління. Вона охоплює сукупність засобів та методів, що дозволяють користувачу збирати, зберігати, передавати і обробляти відібрану інформацію. Місією інформаційної системи є виробництво потрібної для організації інформації, потрібної для ефективного управління всіма її ресурсами, створення інформаційного та технічного середовища для управління її діяльністю.",
      "dekart",
      "моделювання та оптимізація інформаційних систем"
    ));
    this.data.push(new Data_direction("./assets/images/curators/edison.jpg",
      "професор Едісон Е.Е.",
      "Секція \"Управління проектами\"",
      "Проектна діяльність пронизує сьогодні всі сфери функціонування традиційного промислового підприємства: у маркетингу — це проекти маркетингових досліджень, рекламних акцій, виведення на ринок нових продуктів, завоювання нових ринків збуту; у дослідно-конструкторських підрозділах — це проекти розробки нових продуктів, технологій; у виробництві — проекти освоєння випуску нової продукції, технічного переозброєння, впровадження нових технологій; у збуті — проекти побудови торговельно-збутової мережі тощо.",
      "edison",
      "управління проектами регіонального розвитку"
    ));
    this.data.push(new Data_direction("./assets/images/curators/friedman.jpg",
      "професор Фрідмен Ф.Ф.",
      "Секція \"Мережні технології\"",
      "Сучасний етап розвитку світової цивілізації характеризується переходом від індустріального до інформаційного суспільства, що передбачає нові форми соціальної й економічної діяльності, базовані на широкому використанні інформаційних і телекомунікаційних технологій. Технологічною основою такого суспільства є глобальна мережна інформаційна інфраструктура, яка має забезпечити можливість вільного доступу до інформаційних ресурсів кожного жителя планети",
      "friedman",
      "мережні та телекомунікаційні технології в суспільстві"
    ));
    return this.data;
  }
}
